In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from subprocess import check_output

In [2]:
medals = pd.read_csv("file:///Users/linhongteng/Downloads/.csv")
medals.info()
medals.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29216 entries, 0 to 29215
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   City          29216 non-null  object
 1   Edition       29216 non-null  int64
 2   Sport         29216 non-null  object
 3   Discipline    29216 non-null  object
 4   Athlete       29216 non-null  object
 5   NOC           29216 non-null  object
 6   Gender        29216 non-null  object
 7   Event         29216 non-null  object
 8   Event_gender  29216 non-null  object
 9   Medal         29216 non-null  object
dtypes: int64(1), object(9)
memory usage: 2.2+ MB

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [6]:
#1 find the top10 countries ranked by total number of medals
medals_counts = medals["NOC"].value_counts()
print("The total medals: %d" %medals_counts.sum())
print("\nThe top 10 countries:\n", medals_counts.head(10))

The total medals: 29216

The top 10 countries:
 USA    4335
URS    2049
GBR    1594
FRA    1314
ITA    1228
GER    1211
AUS    1075
HUN    1053
SWE    1021
GDR     825
Name: NOC, dtype: int64

In [21]:
#2 find which country won the most medals. (via pivot table)
counted = medals.pivot_table(values="Athlete", index="NOC", columns="Medal", aggfunc="count")
counted["total_medals"] = counted.sum(axis=1)
counted["winning percentage"] = (counted["total_medals"]/medals_counts.sum()).round(2)
counted = counted.sort_values("total_medals", ascending=False)
counted.head(10)

Medal  Bronze    Gold  Silver  total_medals  winning percentage
NOC
USA    1052.0  2088.0  1195.0        4335.0                0.15
URS     584.0   838.0   627.0        2049.0                0.07
GBR     505.0   498.0   591.0        1594.0                0.05
FRA     475.0   378.0   461.0        1314.0                0.04
ITA     374.0   460.0   394.0        1228.0                0.04
GER     454.0   407.0   350.0        1211.0                0.04
AUS     413.0   293.0   369.0        1075.0                0.04
HUN     345.0   400.0   308.0        1053.0                0.04
SWE     325.0   347.0   349.0        1021.0                0.03
GDR     225.0   329.0   271.0         825.0                0.03

In [22]:
#3 find which sport is the most competitive. (via pivot table)
counted = medals.pivot_table(index="Sport", values="Athlete", columns="Medal", aggfunc="count")
counted["total_medals"]= counted.sum(axis=1)
counted["issued percentage"] = (counted["total_medals"]/medals_counts.sum()).round(2)
counted = counted.sort_values("total_medals", ascending=False)
counted.head(10)

Medal       Bronze    Gold  Silver  total_medals  issued percentage
Sport
Aquatics    1256.0  1302.0  1270.0        3828.0               0.13
Athletics   1137.0  1151.0  1160.0        3448.0               0.12
Rowing       840.0   842.0   841.0        2523.0               0.09
Gymnastics   700.0   789.0   725.0        2214.0               0.08
Fencing      497.0   530.0   520.0        1547.0               0.05
Football     471.0   467.0   449.0        1387.0               0.05
Hockey       427.0   454.0   444.0        1325.0               0.05
Wrestling    392.0   373.0   375.0        1140.0               0.04
Shooting     365.0   369.0   371.0        1105.0               0.04
Sailing      309.0   396.0   356.0        1061.0               0.04

In [26]:
# search and adjust duplicated columns. (via drop the duplcated to find the unequal rows)
event_gender_uniques = medals[["Gender", "Event_gender"]].drop_duplicates()
event_gender_uniques

      Gender Event_gender
0        Men            M
348      Men            X
416    Women            W
639    Women            X
23675    Men            W

In [31]:
medals_by_gender = medals.groupby(["Gender", "Event_gender"]).count()
medals_by_gender

                      City  Edition  Sport  Discipline  Athlete    NOC  Event  \
Gender Event_gender
Men    M             20067    20067  20067       20067    20067  20067  20067
       W                 1        1      1           1        1      1      1
       X              1653     1653   1653        1653     1653   1653   1653
Women  W              7277     7277   7277        7277     7277   7277   7277
       X               218      218    218         218      218    218    218

                     Medal
Gender Event_gender
Men    M             20067
       W                 1
       X              1653
Women  W              7277
       X               218

In [32]:
boolean_filter = (medals.Event_gender == "W") & (medals.Gender == "Men")
medals[boolean_filter]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
23675,Sydney,2000,Athletics,Athletics,"CHEPCHUMBA, Joyce",KEN,Men,marathon,W,Bronze

In [33]:
medals.iloc[[23675]]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
23675,Sydney,2000,Athletics,Athletics,"CHEPCHUMBA, Joyce",KEN,Men,marathon,W,Bronze

In [34]:
medals.iloc[[23675],[6]] = "Women"
medals.iloc[[23675]]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
23675,Sydney,2000,Athletics,Athletics,"CHEPCHUMBA, Joyce",KEN,Women,marathon,W,Bronze

In [35]:
# calculate each country gets medals in how many different sports 
Nsports = medals[["NOC","Sport"]].groupby("NOC", as_index=False).agg({"Sport":"nunique"}).sort_values("Sport", ascending=False)
Nsports.head(10)

     NOC  Sport
130  USA     34
43   GBR     31
41   FRA     28
46   GER     26
21   CHN     24
19   CAN     22
6    AUS     22
35   ESP     22
113  SWE     21
62   ITA     21

In [37]:
# the difference of top 10 countries during cold war (1952~1988)
during_cold_war = (medals.Edition >= 1952) & (medals.Edition <= 1988)
is_top10_countries = medals.NOC.isin(["USA","URS","GBR","FRA","ITA","GER","AUS","HUN","SWE","GDR"])
cold_war_medals = medals.loc[during_cold_war & is_top10_countries]
cold_war_medals

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
8018,Helsinki,1952,Aquatics,Diving,"HAASE, Günther",GER,Men,10m platform,M,Bronze
8019,Helsinki,1952,Aquatics,Diving,"LEE, Samuel",USA,Men,10m platform,M,Gold
8021,Helsinki,1952,Aquatics,Diving,"STOVER-IRWIN, Juno Roslays",USA,Women,10m platform,W,Bronze
8022,Helsinki,1952,Aquatics,Diving,"MCCORMICK, Patricia",USA,Women,10m platform,W,Gold
8023,Helsinki,1952,Aquatics,Diving,"MYERS-POPE, Paula Jean",USA,Women,10m platform,W,Silver
...,...,...,...,...,...,...,...,...,...,...
19587,Seoul,1988,Wrestling,Wrestling Gre-R,"TURLYKHANOV, Daulet",URS,Men,68 - 74kg (welterweight),M,Silver
19589,Seoul,1988,Wrestling,Wrestling Gre-R,"MAMIASHVILI, Mikhail",URS,Men,74 - 82kg (middleweight),M,Gold
19590,Seoul,1988,Wrestling,Wrestling Gre-R,"KOMAROMI, Tibor",HUN,Men,74 - 82kg (middleweight),M,Silver
19591,Seoul,1988,Wrestling,Wrestling Gre-R,"POPOV, Vladimir",URS,Men,82 - 90kg (light-heavyweight),M,Bronze
19594,Seoul,1988,Wrestling,Wrestling Gre-R,"KOSLOWSKI, Dennis Marvin",USA,Men,90 - 100kg (heavyweight),M,Bronze

In [38]:
country_grouped = cold_war_medals.groupby("NOC")
list(country_grouped)

[('AUS',
             City  Edition      Sport Discipline  \
  8046   Helsinki     1952   Aquatics   Swimming
  8123   Helsinki     1952  Athletics  Athletics
  8124   Helsinki     1952  Athletics  Athletics
  8136   Helsinki     1952  Athletics  Athletics
  8193   Helsinki     1952  Athletics  Athletics
  ...         ...      ...        ...        ...
  19091     Seoul     1988     Hockey     Hockey
  19092     Seoul     1988     Hockey     Hockey
  19093     Seoul     1988     Hockey     Hockey
  19421     Seoul     1988     Tennis     Tennis
  19422     Seoul     1988     Tennis     Tennis

                                 Athlete  NOC Gender              Event  \
  8046             DAVIES, John Griffith  AUS    Men  200m breaststroke
  8123   STRICKLAND-DE LA HUNTY, Shirley  AUS  Women               100m
  8124                 JACKSON, Marjorie  AUS  Women               100m
  8136                 JACKSON, Marjorie  AUS  Women               200m
  8193   STRICKLAND-DE LA HUNTY, Shirley  AUS  Women        80m hurdles
  ...                                ...  ...    ...                ...
  19091                PISANI, Alexandra  AUS  Women             hockey
  19092                       SMALL, Kim  AUS  Women             hockey
  19093            TOOTH, Liane Marianne  AUS  Women             hockey
  19421                SMYLIE, Elizabeth  AUS  Women            doubles
  19422                  TURNBULL, Wendy  AUS  Women            doubles

        Event_gender   Medal
  8046             M    Gold
  8123             W  Bronze
  8124             W    Gold
  8136             W    Gold
  8193             W    Gold
  ...            ...     ...
  19091            W    Gold
  19092            W    Gold
  19093            W    Gold
  19421            W  Bronze
  19422            W  Bronze

  [348 rows x 10 columns]),
 ('FRA',
             City  Edition     Sport Discipline               Athlete  NOC  \
  8029   Helsinki     1952  Aquatics     Diving     MOREAU, Madeleine  FRA
  8032   Helsinki     1952  Aquatics   Swimming        BOZON, Gilbert  FRA
  8052   Helsinki     1952  Aquatics   Swimming         BOITEUX, Jean  FRA
  8069   Helsinki     1952  Aquatics   Swimming      BERNARDO, Joseph  FRA
  8070   Helsinki     1952  Aquatics   Swimming         BOITEUX, Jean  FRA
  ...         ...      ...       ...        ...                   ...  ...
  19311     Seoul     1988   Sailing    Sailing     PEPONNET, Thierry  FRA
  19312     Seoul     1988   Sailing    Sailing           PILLOT, Luc  FRA
  19344     Seoul     1988   Sailing    Sailing       HENARD, Nicolas  FRA
  19345     Seoul     1988   Sailing    Sailing  LE DEROFF, Jean Yves  FRA
  19365     Seoul     1988  Shooting   Shooting    BERTHELOT, Nicolas  FRA

        Gender                     Event Event_gender   Medal
  8029   Women            3m springboard            W  Silver
  8032     Men           100m backstroke            M  Silver
  8052     Men            400m freestyle            M    Gold
  8069     Men    4x200m freestyle relay            M  Bronze
  8070     Men    4x200m freestyle relay            M  Bronze
  ...      ...                       ...          ...     ...
  19311    Men   470 - Two Person Dinghy            M    Gold
  19312    Men   470 - Two Person Dinghy            M    Gold
  19344    Men       Tornado - Multihull            X    Gold
  19345    Men       Tornado - Multihull            X    Gold
  19365    Men  10m air rifle (60 shots)            M  Silver

  [308 rows x 10 columns]),
 ('GBR',
             City  Edition      Sport Discipline                    Athlete  \
  8048   Helsinki     1952   Aquatics   Swimming    GORDON-MCKAY, Helen Orr
  8120   Helsinki     1952  Athletics  Athletics  BAILEY, Emmanuel Mcdonald
  8138   Helsinki     1952  Athletics  Athletics          DISLEY, John Ivor
  8159   Helsinki     1952  Athletics  Athletics      ARMITAGE, Heather Joy
  8160   Helsinki     1952  Athletics  Athletics          CHEESEMAN, Sylvia
  ...         ...      ...        ...        ...                        ...
  19272     Seoul     1988     Rowing     Rowing      SWEENEY, Patrick John
  19350     Seoul     1988    Sailing    Sailing   MCINTYRE, Michael Mackay
  19351     Seoul     1988    Sailing    Sailing      VAILE, Philip Brynolf
  19379     Seoul     1988   Shooting   Shooting    COOPER, Malcolm Douglas
  19380     Seoul     1988   Shooting   Shooting      ALLAN, Alister Millar

         NOC Gender                                Event Event_gender   Medal
  8048   GBR  Women                    200m breaststroke            W  Bronze
  8120   GBR    Men                                 100m            M  Bronze
  8138   GBR    Men                   3000m steeplechase            M  Bronze
  8159   GBR  Women                         4x100m relay            W  Bronze
  8160   GBR  Women                         4x100m relay            W  Bronze
  ...    ...    ...                                  ...          ...     ...
  19272  GBR    Men  pair-oared shell with coxswain (2+)            M  Bronze
  19350  GBR    Men      two-person keelboat open (Star)            X    Gold
  19351  GBR    Men      two-person keelboat open (Star)            X    Gold
  19379  GBR    Men   50m rifle 3 positions (3x40 shots)            M    Gold
  19380  GBR    Men   50m rifle 3 positions (3x40 shots)            M  Silver

  [381 rows x 10 columns]),
 ('GDR',
           City  Edition          Sport       Discipline            Athlete  \
  11697  Mexico     1968       Aquatics         Swimming    MATTHES, Roland
  11724  Mexico     1968       Aquatics         Swimming    MATTHES, Roland
  11740  Mexico     1968       Aquatics         Swimming     LINDNER, Helga
  11762  Mexico     1968       Aquatics         Swimming  STEINBACH, Sabine
  11785  Mexico     1968       Aquatics         Swimming   KRAUSE, Roswitha
  ...       ...      ...            ...              ...                ...
  19388   Seoul     1988       Shooting         Shooting       WEGNER, Axel
  19516   Seoul     1988  Weightlifting    Weightlifting      WELLER, Ronny
  19523   Seoul     1988  Weightlifting    Weightlifting      KUNZ, Joachim
  19527   Seoul     1988  Weightlifting    Weightlifting  STEINHOEFEL, Ingo
  19540   Seoul     1988      Wrestling  Wrestling Free.  SCHRÖDER, Andreas

         NOC Gender                              Event Event_gender   Medal
  11697  GDR    Men                    100m backstroke            M    Gold
  11724  GDR    Men                    200m backstroke            M    Gold
  11740  GDR  Women                     200m butterfly            W  Silver
  11762  GDR  Women             400m individual medley            W  Bronze
  11785  GDR  Women             4x100m freestyle relay            W  Silver
  ...    ...    ...                                ...          ...     ...
  19388  GDR    Men                skeet (125 targets)            X    Gold
  19516  GDR    Men   100 - 110kg, total (heavyweight)            M  Bronze
  19523  GDR    Men   60 - 67.5kg, total (lightweight)            M    Gold
  19527  GDR    Men  67.5 - 75kg, total (middleweight)            M  Silver
  19540  GDR    Men    100 - 130kg (super heavyweight)            M  Bronze

  [825 rows x 10 columns]),
 ('GER',
            City  Edition          Sport       Discipline  \
  8018  Helsinki     1952       Aquatics           Diving
  8045  Helsinki     1952       Aquatics         Swimming
  8129  Helsinki     1952      Athletics        Athletics
  8167  Helsinki     1952      Athletics        Athletics
  8168  Helsinki     1952      Athletics        Athletics
  8169  Helsinki     1952      Athletics        Athletics
  8170  Helsinki     1952      Athletics        Athletics
  8171  Helsinki     1952      Athletics        Athletics
  8172  Helsinki     1952      Athletics        Athletics
  8173  Helsinki     1952      Athletics        Athletics
  8174  Helsinki     1952      Athletics        Athletics
  8183  Helsinki     1952      Athletics        Athletics
  8189  Helsinki     1952      Athletics        Athletics
  8192  Helsinki     1952      Athletics        Athletics
  8206  Helsinki     1952      Athletics        Athletics
  8236  Helsinki     1952      Athletics        Athletics
  8283  Helsinki     1952         Boxing           Boxing
  8304  Helsinki     1952         Boxing           Boxing
  8326  Helsinki     1952  Canoe / Kayak  Canoe / Kayak F
  8327  Helsinki     1952  Canoe / Kayak  Canoe / Kayak F
  8332  Helsinki     1952  Canoe / Kayak  Canoe / Kayak F
  8333  Helsinki     1952  Canoe / Kayak  Canoe / Kayak F
  8338  Helsinki     1952  Canoe / Kayak  Canoe / Kayak F
  8359  Helsinki     1952        Cycling     Cycling Road
  8380  Helsinki     1952        Cycling    Cycling Track
  8398  Helsinki     1952     Equestrian         Dressage
  8399  Helsinki     1952     Equestrian         Dressage
  8406  Helsinki     1952     Equestrian         Dressage
  8407  Helsinki     1952     Equestrian         Eventing
  8416  Helsinki     1952     Equestrian         Eventing
  8417  Helsinki     1952     Equestrian         Eventing
  8418  Helsinki     1952     Equestrian         Eventing
  8419  Helsinki     1952     Equestrian          Jumping
  8545  Helsinki     1952     Gymnastics      Artistic G.
  8767  Helsinki     1952         Rowing           Rowing
  8768  Helsinki     1952         Rowing           Rowing
  8769  Helsinki     1952         Rowing           Rowing
  8799  Helsinki     1952        Sailing          Sailing
  8800  Helsinki     1952        Sailing          Sailing
  8801  Helsinki     1952        Sailing          Sailing

                                 Athlete  NOC Gender  \
  8018                    HAASE, Günther  GER    Men
  8045                    KLEIN, Herbert  GER    Men
  8129                      LUEG, Werner  GER    Men
  8167                      KLEIN, Helga  GER  Women
  8168                        KNAB, Ulla  GER  Women
  8169         PETERSEN-KALLENSEE, Marga  GER  Women
  8170           SANDER-DOMAGELLA, Maria  GER  Women
  8171                     GEISTER, Hans  GER    Men
  8172              HAAS, Karl-Friedrich  GER    Men
  8173                  STEINES, Günther  GER    Men
  8174                  ULZHEIMER, Heinz  GER    Men
  8183                   SCHADE, Herbert  GER    Men
  8189                  ULZHEIMER, Heinz  GER    Men
  8192           SANDER-DOMAGELLA, Maria  GER  Women
  8206                      STORCH, Karl  GER    Men
  8236   WERNER-SCHULZE-ENTRUP, Marianne  GER  Women
  8283                      BASEL, Edgar  GER    Men
  8304                HEIDEMANN, Günther  GER    Men
  8326                       DREWS, Egon  GER    Men
  8327                  SOLTAU, Wilfried  GER    Men
  8332                       DREWS, Egon  GER    Men
  8333                  SOLTAU, Wilfried  GER    Men
  8338                  SCHEUER, Michael  GER    Men
  8359              ZIEGLER, Edwin (Edy)  GER    Men
  8380               POTZERNHEIM, Werner  GER    Men
  8398                     POLLAY, Heinz  GER    Men
  8399                 THIEDEMANN, Fritz  GER    Men
  8406                    VON NAGEL, Ida  GER  Women
  8407           BÜSING, Wilhelm "Willy"  GER    Men
  8416           BÜSING, Wilhelm "Willy"  GER    Men
  8417                       ROTHE, Otto  GER    Men
  8418                     WAGNER, Klaus  GER    Men
  8419                 THIEDEMANN, Fritz  GER    Men
  8545          SCHWARZMANN, Karl-Alfred  GER    Men
  8767                  HEINHOLD, Helmut  GER    Men
  8768            MANCHEN, Heinz Joachim  GER    Men
  8769                      NOLL, Helmut  GER    Men
  8799  NATUSCH, Erich Friedrich Wilhelm  GER    Men
  8800                      NOWKA, Georg  GER    Men
  8801                  THOMSEN, Theodor  GER    Men

                                      Event Event_gender   Medal
  8018                         10m platform            M  Bronze
  8045                    200m breaststroke            M  Bronze
  8129                                1500m            M  Bronze
  8167                         4x100m relay            W  Silver
  8168                         4x100m relay            W  Silver
  8169                         4x100m relay            W  Silver
  8170                         4x100m relay            W  Silver
  8171                         4x400m relay            M  Bronze
  8172                         4x400m relay            M  Bronze
  8173                         4x400m relay            M  Bronze
  8174                         4x400m relay            M  Bronze
  8183                                5000m            M  Bronze
  8189                                 800m            M  Bronze
  8192                          80m hurdles            W  Bronze
  8206                         hammer throw            M  Silver
  8236                             shot put            W  Silver
  8283                   - 51kg (flyweight)            M  Silver
  8304           63.5 - 67kg (welterweight)            M  Bronze
  8326                           C-2 10000m            M  Bronze
  8327                           C-2 10000m            M  Bronze
  8332             C-2 1000m (canoe double)            M  Bronze
  8333             C-2 1000m (canoe double)            M  Bronze
  8338                           K-1 10000m            M  Bronze
  8359                 individual road race            M  Bronze
  8380                      Sprint indivual            M  Bronze
  8398                                 team            X  Bronze
  8399                                 team            X  Bronze
  8406                                 team            X  Bronze
  8407                           individual            X  Bronze
  8416                                 team            X  Silver
  8417                                 team            X  Silver
  8418                                 team            X  Silver
  8419                           individual            X  Bronze
  8545                       horizontal bar            M  Silver
  8767  pair-oared shell with coxswain (2+)            M  Silver
  8768  pair-oared shell with coxswain (2+)            M  Silver
  8769  pair-oared shell with coxswain (2+)            M  Silver
  8799                               dragon            X  Bronze
  8800                               dragon            X  Bronze
  8801                               dragon            X  Bronze  ),
 ('HUN',
             City  Edition          Sport       Discipline            Athlete  \
  8039   Helsinki     1952       Aquatics         Swimming      TEMES, Judith
  8040   Helsinki     1952       Aquatics         Swimming     SZÖKE, Katalin
  8049   Helsinki     1952       Aquatics         Swimming       SZEKELY, Eva
  8050   Helsinki     1952       Aquatics         Swimming  NOVAK-GERARD, Eva
  8055   Helsinki     1952       Aquatics         Swimming    GYENGE, Valeria
  ...         ...      ...            ...              ...                ...
  19381     Seoul     1988       Shooting         Shooting    ZAHONYI, Attila
  19518     Seoul     1988  Weightlifting    Weightlifting      JACSO, Jozsef
  19530     Seoul     1988  Weightlifting    Weightlifting     MESSZI, Istvan
  19577     Seoul     1988      Wrestling  Wrestling Gre-R       SIKE, Andras
  19590     Seoul     1988      Wrestling  Wrestling Gre-R    KOMAROMI, Tibor

         NOC Gender                                   Event Event_gender   Medal
  8039   HUN  Women                          100m freestyle            W  Bronze
  8040   HUN  Women                          100m freestyle            W    Gold
  8049   HUN  Women                       200m breaststroke            W    Gold
  8050   HUN  Women                       200m breaststroke            W  Silver
  8055   HUN  Women                          400m freestyle            W    Gold
  ...    ...    ...                                     ...          ...     ...
  19381  HUN    Men              50m rifle prone (60 shots)            M  Bronze
  19518  HUN    Men        100 - 110kg, total (heavyweight)            M  Silver
  19530  HUN    Men  75 - 82.5kg, total (light-heavyweight)            M  Silver
  19577  HUN    Men                52 - 57kg (bantamweight)            M    Gold
  19590  HUN    Men                74 - 82kg (middleweight)            M  Silver

  [608 rows x 10 columns]),
 ('ITA',
             City  Edition      Sport       Discipline              Athlete  \
  8081   Helsinki     1952   Aquatics       Water polo   ARENA, Ermenegildo
  8082   Helsinki     1952   Aquatics       Water polo     CECCARINI, Lucio
  8083   Helsinki     1952   Aquatics       Water polo  DE SANZUANE, Renato
  8084   Helsinki     1952   Aquatics       Water polo   GAMBINO, Raffaello
  8085   Helsinki     1952   Aquatics       Water polo    GIONTA, Salvatore
  ...         ...      ...        ...              ...                  ...
  19283     Seoul     1988     Rowing           Rowing  ABBAGNALE, Agostino
  19284     Seoul     1988     Rowing           Rowing     FARINA, Gianluca
  19285     Seoul     1988     Rowing           Rowing          POLI, Piero
  19286     Seoul     1988     Rowing           Rowing      TIZZANO, Davide
  19568     Seoul     1988  Wrestling  Wrestling Gre-R     MAENZA, Vincenzo

         NOC Gender                                   Event Event_gender   Medal
  8081   ITA    Men                              water polo            M  Bronze
  8082   ITA    Men                              water polo            M  Bronze
  8083   ITA    Men                              water polo            M  Bronze
  8084   ITA    Men                              water polo            M  Bronze
  8085   ITA    Men                              water polo            M  Bronze
  ...    ...    ...                                     ...          ...     ...
  19283  ITA    Men  quadruple sculls without coxswain (4x)            M    Gold
  19284  ITA    Men  quadruple sculls without coxswain (4x)            M    Gold
  19285  ITA    Men  quadruple sculls without coxswain (4x)            M    Gold
  19286  ITA    Men  quadruple sculls without coxswain (4x)            M    Gold
  19568  ITA    Men                - 48kg (light-flyweight)            M    Gold

  [454 rows x 10 columns]),
 ('SWE',
             City  Edition         Sport       Discipline            Athlete  \
  8036   Helsinki     1952      Aquatics         Swimming     LARSSON, Göran
  8051   Helsinki     1952      Aquatics         Swimming  ÖSTRAND, Per-Olof
  8118   Helsinki     1952     Athletics        Athletics   MIKAELSSON, John
  8225   Helsinki     1952     Athletics        Athletics    JANSSON, Gustaf
  8228   Helsinki     1952     Athletics        Athletics   LUNDBERG, Ragnar
  ...         ...      ...           ...              ...                ...
  19405     Seoul     1988  Table Tennis     Table Tennis        LINDH, Erik
  19411     Seoul     1988        Tennis           Tennis     EDBERG, Stefan
  19412     Seoul     1988        Tennis           Tennis     JARRYD, Anders
  19427     Seoul     1988        Tennis           Tennis     EDBERG, Stefan
  19570     Seoul     1988     Wrestling  Wrestling Gre-R   JOHANSSON, Tomas

         NOC Gender                            Event Event_gender   Medal
  8036   SWE    Men                   100m freestyle            M  Bronze
  8051   SWE    Men                   400m freestyle            M  Bronze
  8118   SWE    Men                      10000m walk            M    Gold
  8225   SWE    Men                         marathon            M  Bronze
  8228   SWE    Men                       pole vault            M  Bronze
  ...    ...    ...                              ...          ...     ...
  19405  SWE    Men                          singles            M  Bronze

In [40]:
# each country medals in each yeat. (via pivot table)
medals_won_by_country = medals.pivot_table(index="Edition", values="Athlete", columns="NOC", aggfunc="count", margins=True)
medals_won_by_country

NOC,AFG,AHO,ALG,ANZ,ARG,ARM,AUS,AUT,AZE,BAH,...,URU,USA,UZB,VEN,VIE,YUG,ZAM,ZIM,ZZX,All
Edition,,,,,,,,,,,,,,,,,,,,,
1896,NaN,NaN,NaN,NaN,NaN,NaN,2.0,5.0,NaN,NaN,...,NaN,20.0,NaN,NaN,NaN,NaN,NaN,NaN,6.0,151
1900,NaN,NaN,NaN,NaN,NaN,NaN,5.0,6.0,NaN,NaN,...,NaN,55.0,NaN,NaN,NaN,NaN,NaN,NaN,34.0,512
1904,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,394.0,NaN,NaN,NaN,NaN,NaN,NaN,8.0,470
1908,NaN,NaN,NaN,19.0,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,63.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,804
1912,NaN,NaN,NaN,10.0,NaN,NaN,NaN,14.0,NaN,NaN,...,NaN,101.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,885
1920,NaN,NaN,NaN,NaN,NaN,NaN,6.0,NaN,NaN,NaN,...,NaN,193.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1298
1924,NaN,NaN,NaN,NaN,11.0,NaN,10.0,4.0,NaN,NaN,...,22.0,198.0,NaN,NaN,NaN,2.0,NaN,NaN,NaN,884
1928,NaN,NaN,NaN,NaN,32.0,NaN,4.0,4.0,NaN,NaN,...,22.0,84.0,NaN,NaN,NaN,12.0,NaN,NaN,NaN,710
1932,NaN,NaN,NaN,NaN,4.0,NaN,5.0,5.0,NaN,NaN,...,1.0,181.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,615
1936,NaN,NaN,NaN,NaN,11.0,NaN,1.0,50.0,NaN,NaN,...,NaN,92.0,NaN,NaN,NaN,1.0,NaN,NaN,NaN,875
1948,NaN,NaN,NaN,NaN,12.0,NaN,16.0,4.0,NaN,NaN,...,3.0,148.0,NaN,NaN,NaN,16.0,NaN,NaN,NaN,814
1952,NaN,NaN,NaN,NaN,6.0,NaN,20.0,3.0,NaN,NaN,...,14.0,130.0,NaN,1.0,NaN,24.0,NaN,NaN,NaN,889
1956,NaN,NaN,NaN,NaN,2.0,NaN,61.0,4.0,NaN,2.0,...,12.0,118.0,NaN,NaN,NaN,23.0,NaN,NaN,NaN,885
1960,NaN,NaN,NaN,NaN,4.0,NaN,36.0,3.0,NaN,NaN,...,NaN,112.0,NaN,1.0,NaN,17.0,NaN,NaN,NaN,882
1964,NaN,NaN,NaN,NaN,1.0,NaN,42.0,NaN,NaN,2.0,...,1.0,150.0,NaN,NaN,NaN,15.0,NaN,NaN,NaN,1010
1968,NaN,NaN,NaN,NaN,2.0,NaN,49.0,5.0,NaN,NaN,...,NaN,149.0,NaN,1.0,NaN,29.0,NaN,NaN,NaN,1031
1972,NaN,NaN,NaN,NaN,1.0,NaN,20.0,3.0,NaN,NaN,...,NaN,155.0,NaN,NaN,NaN,18.0,NaN,NaN,NaN,1185
1976,NaN,NaN,NaN,NaN,NaN,NaN,24.0,1.0,NaN,NaN,...,NaN,155.0,NaN,1.0,NaN,19.0,NaN,NaN,NaN,1305
1980,NaN,NaN,NaN,NaN,NaN,NaN,12.0,5.0,NaN,NaN,...,NaN,NaN,NaN,1.0,NaN,57.0,NaN,16.0,NaN,1387
1984,NaN,NaN,2.0,NaN,NaN,NaN,50.0,3.0,NaN,NaN,...,NaN,333.0,NaN,3.0,NaN,87.0,1.0,NaN,NaN,1459
1988,NaN,1.0,NaN,NaN,13.0,NaN,34.0,1.0,NaN,NaN,...,NaN,193.0,NaN,NaN,NaN,63.0,NaN,NaN,NaN,1546
1992,NaN,NaN,2.0,NaN,2.0,NaN,57.0,6.0,NaN,1.0,...,NaN,224.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1705
1996,NaN,NaN,3.0,NaN,20.0,2.0,132.0,3.0,1.0,5.0,...,NaN,260.0,2.0,NaN,NaN,26.0,1.0,NaN,NaN,1859
2000,NaN,NaN,5.0,NaN,20.0,1.0,183.0,4.0,3.0,6.0,...,1.0,248.0,4.0,NaN,1.0,26.0,NaN,NaN,NaN,2015
2004,NaN,NaN,NaN,NaN,47.0,NaN,157.0,8.0,5.0,2.0,...,NaN,264.0,5.0,2.0,NaN,NaN,NaN,3.0,NaN,1998
2008,1.0,NaN,2.0,NaN,51.0,6.0,149.0,3.0,7.0,5.0,...,NaN,315.0,6.0,1.0,1.0,NaN,NaN,4.0,NaN,2042
All,1.0,1.0,14.0,29.0,239.0,9.0,1075.0,146.0,16.0,23.0,...,76.0,4335.0,17.0,11.0,2.0,435.0,2.0,23.0,48.0,29216

In [42]:
# top 10 countries medals during cold war
cold_war_top10_countries_medals = medals_won_by_country.loc[1952:1988, ["USA","URS","GBR","FRA","ITA","GER","AUS","HUN","SWE","GDR"]]
cold_war_top10_countries_medals

NOC        USA    URS   GBR   FRA   ITA   GER   AUS    HUN   SWE    GDR
Edition
1952     130.0  117.0  31.0  39.0  53.0  40.0  20.0  101.0  70.0    NaN
1956     118.0  169.0  45.0  32.0  46.0   NaN  61.0   64.0  34.0    NaN
1960     112.0  169.0  28.0  11.0  88.0   NaN  36.0   65.0   7.0    NaN
1964     150.0  174.0  28.0  31.0  50.0   NaN  42.0   56.0  15.0    NaN
1968     149.0  188.0  18.0  27.0  32.0   NaN  49.0   81.0   9.0   51.0
1972     155.0  211.0  29.0  22.0  25.0   NaN  20.0   81.0  21.0  148.0
1976     155.0  285.0  32.0  20.0  31.0   NaN  24.0   55.0  10.0  192.0
1980       NaN  442.0  45.0  29.0  37.0   NaN  12.0   61.0  18.0  260.0
1984     333.0    NaN  72.0  68.0  63.0   NaN  50.0    NaN  32.0    NaN
1988     193.0  294.0  53.0  29.0  29.0   NaN  34.0   44.0  16.0  174.0

In [58]:
print('Consistency during cold war\n',cold_war_top10_countries_medals.idxmax(axis=1))
print('\nTotal counts\n', cold_war_top10_countries_medals.idxmax(axis=1).value_counts())

Consistency during cold war
 Edition
1952    USA
1956    URS
1960    URS
1964    URS
1968    URS
1972    URS
1976    URS
1980    URS
1984    USA
1988    URS
dtype: object

Total counts
 URS    8
USA    2
dtype: int64

In [61]:
# top 10 countries medals after cold war
after_cold_war_top10_countries_medals = medals_won_by_country.loc[1992:2008, ["USA","URS","GBR","FRA","ITA","GER","AUS","HUN","SWE","GDR"]]
after_cold_war_top10_countries_medals

NOC        USA  URS   GBR   FRA    ITA    GER    AUS   HUN   SWE  GDR
Edition
1992     224.0  NaN  50.0  57.0   46.0  198.0   57.0  45.0  35.0  NaN
1996     260.0  NaN  26.0  51.0   71.0  124.0  132.0  43.0  31.0  NaN
2000     248.0  NaN  55.0  66.0   65.0  119.0  183.0  53.0  32.0  NaN
2004     264.0  NaN  57.0  53.0  102.0  149.0  157.0  40.0  12.0  NaN
2008     315.0  NaN  77.0  76.0   42.0  101.0  149.0  27.0   7.0  NaN

In [65]:
after_cold_war_top10_countries_medals.pct_change().round(2)

NOC       USA  URS   GBR   FRA   ITA   GER   AUS   HUN   SWE  GDR
Edition
1992      NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  NaN
1996     0.16  NaN -0.48 -0.11  0.54 -0.37  1.32 -0.04 -0.11  NaN
2000    -0.05  NaN  1.12  0.29 -0.08 -0.04  0.39  0.23  0.03  NaN
2004     0.06  NaN  0.04 -0.20  0.57  0.25 -0.14 -0.25 -0.62  NaN
2008     0.19  NaN  0.35  0.43 -0.59 -0.32 -0.05 -0.32 -0.42  NaN

In [66]:
print('Consistency after cold war\n',after_cold_war_top10_countries_medals.idxmax(axis=1))
print('\nTotal counts\n', after_cold_war_top10_countries_medals.idxmax(axis=1).value_counts())

Consistency after cold war
 Edition
1992    USA
1996    USA
2000    USA
2004    USA
2008    USA
dtype: object

Total counts
 USA    5
dtype: int64